app/controllers/comments_controller.rb

SELECT  "links".* FROM "links"  WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "link_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["created_at", "2014-12-29 23:49:54.756626"], ["link_id", 1], ["updated_at", "2014-12-29 23:49:54.756626"], ["user_id", 1]]
---
  def create

   @link = Link.find(params[:link_id])
   @comment = @link.comments.new(comment_params)
   @comment.user = current_user

    respond_to do |format|
      if @comment.save