app/controllers/links_controller.rb

INSERT INTO "links" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-29 23:46:34.779251"], ["title", "google"], ["updated_at", "2014-12-29 23:46:34.779251"], ["url", "google.com"], ["user_id", 1]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 2]]
---
  def destroy
    @link.destroy

SELECT  "links".* FROM "links"  WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links"  WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
---
  def downvote
    @link = Link.find(params[:id])